app/controllers/image_comments_controller.rb

  def index
    @image_comments = ImageComment.all
---
SELECT "image_comments".* FROM "image_comments"

  def create
    @image_comment = ImageComment.new(image_comment_params)
    @image_comment.user_id = current_user.id

    url = "/images/" + @image_comment.image_id.to_s
    respond_to do |format|
      if @image_comment.save
---
INSERT INTO "image_comments" ("image_id", "comment", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["image_id", 2], ["comment", "comment 1"], ["user_id", 1], ["created_at", "2019-03-27 02:30:38.340914"], ["updated_at", "2019-03-27 02:30:38.340914"]]

    def set_image_comment
      @image_comment = ImageComment.find(params[:id])
---
SELECT  "image_comments".* FROM "image_comments" WHERE "image_comments"."id" = ? LIMIT 1  [["id", 1]]