app/views/images/show.html.erb

SELECT "image_comments".* FROM "image_comments" WHERE "image_comments"."image_id" = ?  [["image_id", 2]]
---
<strong>List Comments:</strong> <br>
<% @image.image_comments.each do |image_comment| %>